## Plan Result (transactional-emails-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11807465396)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 5 to add, 2 to change, 5 to destroy.</code></pre>

* Create
  * aws_sns_topic_subscription.ForgotPasswordEvents-sns-subscription
  * aws_sns_topic_subscription.ListExportReadyEvents-sns-subscription
  * aws_sns_topic_subscription.PremiumPurchaseEvents-sns-subscription
  * aws_sns_topic_subscription.UserEvents-sns-subscription
  * aws_sns_topic_subscription.UserRegistrationEvents-sns-subscription
* Update
  * aws_sqs_queue_policy.transactional-email-sns-dlq-policy
  * aws_sqs_queue_policy.transactional-email-sns-sqs-policy
* Delete
  * aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription
  * aws_sns_topic_subscription.ListExportReady-Topic-sns-subscription
  * aws_sns_topic_subscription.PremiumPurchase-Topic-sns-subscription
  * aws_sns_topic_subscription.UserEventTopic-sns-subscription
  * aws_sns_topic_subscription.UserRegistrationTopic-sns-subscription



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.ForgotPasswordEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ForgotPasswordEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordEvents"
    }

  # aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "ForgotPasswordRequest-Topic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic:1d1843f4-f405-4384-823a-ad21801a0af1" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic:1d1843f4-f405-4384-823a-ad21801a0af1" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.ListExportReady-Topic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.ListExportReady-Topic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "ListExportReady-Topic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReady-Topic:872b7d46-b4f9-47fd-ad89-ea63979dde62" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReady-Topic:872b7d46-b4f9-47fd-ad89-ea63979dde62" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReady-Topic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.ListExportReadyEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ListExportReadyEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReadyEvents"
    }

  # aws_sns_topic_subscription.PremiumPurchase-Topic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.PremiumPurchase-Topic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "PremiumPurchase-Topic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic:1d3fa66d-5971-45b2-b9f1-dd5a030e292e" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic:1d3fa66d-5971-45b2-b9f1-dd5a030e292e" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.PremiumPurchaseEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "PremiumPurchaseEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchaseEvents"
    }

  # aws_sns_topic_subscription.UserEventTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.UserEventTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "UserEventTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:354cdd64-8e94-453d-8f6e-b46d2540f7e7" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:354cdd64-8e94-453d-8f6e-b46d2540f7e7" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.UserEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "UserEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
    }

  # aws_sns_topic_subscription.UserRegistrationEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "UserRegistrationEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationEvents"
    }

  # aws_sns_topic_subscription.UserRegistrationTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.UserRegistrationTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "UserRegistrationTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic:157e1ede-de97-4e2f-93aa-e1bc7f97806d" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic:157e1ede-de97-4e2f-93aa-e1bc7f97806d" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.transactional-email-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchaseEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReady-Topic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReadyEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.transactional-email-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchaseEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReady-Topic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListExportReadyEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 2 to change, 5 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":950,"Program":"tfcmt","SHA1":"30995768cfe3eb840fc69e2735e0ffbba670a40e","Target":"transactional-emails-cdk-production","Vars":{},"WorkflowName":"Transactional Emails"} -->